app/views/welcome/index.html.erb

SELECT SUM("expenses"."price") FROM "expenses"
---
<% @missed.each do |wishlist| %>
	 <% next if @d+wishlist.price >= Expense.sum('price') %>

SELECT SUM("expenses"."price") FROM "expenses"
---

      <% next if @d >= Expense.sum('price') %>

SELECT COUNT("expenses"."description") FROM "expenses"
SELECT "wishlists".* FROM "wishlists"
SELECT COUNT("wishlists"."description") FROM "wishlists"
SELECT SUM("expenses"."price") FROM "expenses"
SELECT SUM("wishlists"."price") FROM "wishlists"
---

<div class="jumbotron">
	<h1>You've <%= Expense.count('description') %> recorded expense(s)</h1><br>
	<h1>that total <%= number_to_currency(Expense.sum('price')) %> this month. </h1><br>
	<button type = button, class = class: "btn btn-primary"><%= link_to 'View/Add Expenses' , controller: 'expenses' %></button><br>
	<br>
	<br>
	<h1>You've <%= Wishlist.count('description') %> Wish List item(s)</h1><br>
	<h1>that total <%= number_to_currency(Wishlist.sum('price')) %> worth of item(s). </h1> <br>

SELECT SUM("expenses"."price") FROM "expenses"
---
    <% @missed.each do |wishlist| %>
	 <% next if @i+wishlist.price >= Expense.sum('price') %>

SELECT SUM("expenses"."price") FROM "expenses"
---
      </tr>
      <% next if @i >= Expense.sum('price') %>