app/views/welcome/index.html.erb


<div class="jumbotron">
	<h1>You've <%= Expense.count('description') %> recorded expense(s)</h1><br>
	<h1>that total <%= number_to_currency(Expense.sum('price')) %> this month. </h1><br>
	<button type = button, class = class: "btn btn-primary"><%= link_to 'View/Add Expenses' , controller: 'expenses' %></button><br>
	<br>
	<br>
	<h1>You've <%= Wishlist.count('description') %> Wish List item(s)</h1><br>
	<h1>that total <%= number_to_currency(Wishlist.sum('price')) %> worth of item(s). </h1> <br>
---
SELECT COUNT("expenses"."description") FROM "expenses"
SELECT "wishlists".* FROM "wishlists"
SELECT COUNT("wishlists"."description") FROM "wishlists"
SELECT SUM("wishlists"."price") FROM "wishlists"