app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "byebug testing"], ["text", "testing the bye bug stuff"], ["created_at", "2019-10-24 16:48:39.598882"], ["updated_at", "2019-10-24 16:48:39.598882"]]
---
    def create
        @article = Article.new(article_params)
        byebug

        if @article.save