app/controllers/expenses_controller.rb

SELECT "expenses".* FROM "expenses"
SELECT SUM() FROM "expenses"
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
 def index
        @expenses = Expense.all
        @theUser = User.all

SELECT  "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @expense = Expense.find(params[:id])

SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
    def new
        @expense = Expense.new
         @theUser = User.all

INSERT INTO "expenses" ("description", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "testttt"], ["price", 3.0], ["created_at", "2019-10-26 11:13:29.058773"], ["updated_at", "2019-10-26 11:13:29.058773"]]
---
    def create
        @expense = Expense.new(expense_params)
         @theUser = User.all


        if @expense.save

SELECT  "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @theUser = User.all
        @expense = Expense.find(params[:id])

SELECT  "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "expenses" SET "description" = ?, "updated_at" = ? WHERE "expenses"."id" = ?  [["description", "aids test"], ["updated_at", "2019-10-29 16:39:03.585693"], ["id", 11]]
---
    def update
         @theUser = User.all
        @expense = Expense.find(params[:id])
        if @expense.update(expense_params)

SELECT  "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "expenses" WHERE "expenses"."id" = ?  [["id", 1]]
---
    def destroy
        @expense = Expense.find(params[:id])
        @expense.destroy