app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)


        if @user.save
---
INSERT INTO "users" ("firstName", "lastName", "email", "userName", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)