app/controllers/welcome_controller.rb

  def index
    @missed = Wishlist.all
  @theUser = User.all
---
SELECT "wishlists".* FROM "wishlists"
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]