app/controllers/wishlists_controller.rb

SELECT "wishlists".* FROM "wishlists"
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
def index
        @wishlists = Wishlist.all
        @theUser = User.all

SELECT  "wishlists".* FROM "wishlists" WHERE "wishlists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @wishlist = Wishlist.find(params[:id])

SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
    def new
        @wishlist = Wishlist.new
         @theUser = User.all

INSERT INTO "wishlists" ("description", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "test"], ["price", 122.0], ["created_at", "2019-10-26 11:07:07.983336"], ["updated_at", "2019-10-26 11:07:07.983336"]]
---
    def create
        @wishlist = Wishlist.new(wishlist_params)
         @theUser = User.all


        if @wishlist.save

SELECT  "wishlists".* FROM "wishlists" WHERE "wishlists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def edit
         @theUser = User.all
        @wishlist = Wishlist.find(params[:id])

SELECT  "wishlists".* FROM "wishlists" WHERE "wishlists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "wishlists" SET "price" = ?, "updated_at" = ? WHERE "wishlists"."id" = ?  [["price", 3.0], ["updated_at", "2019-10-26 11:09:45.986065"], ["id", 2]]
---
    def update
        @theUser = User.all
        @wishlist = Wishlist.find(params[:id])
        if @wishlist.update(wishlist_params)

SELECT  "wishlists".* FROM "wishlists" WHERE "wishlists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "wishlists" WHERE "wishlists"."id" = ?  [["id", 1]]
---
    def destroy
        @wishlist = Wishlist.find(params[:id])
        @wishlist.destroy