app/views/wishlists/index.html.erb


<h1>Listing WishList</h1>
 </div>
 <div class="jumbotron">
 	<h1>You've <%= Wishlist.count('description') %> recorded expense(s)</h1><br>
  <h1>You have <%= number_to_currency(Wishlist.sum('price')) %> worth of items</h1><br>
---
SELECT "wishlists".* FROM "wishlists"
SELECT COUNT("wishlists"."description") FROM "wishlists"
SELECT SUM("wishlists"."price") FROM "wishlists"