app/views/expenses/index.html.erb


 	<h1>You've <%= Expense.count('description') %> recorded expense(s)</h1><br>
---
SELECT "expenses".* FROM "expenses"
SELECT COUNT("expenses"."description") FROM "expenses"